# Lab 5

Integrantes:

*Jessica Robles*

*Maria Paula Gonzalez*

*Juan Esteban Vergara*

## 1. Importar librerias

In [1]:
seed = 161
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import json

# Composicion de pipelines
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import PolynomialFeatures
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import StandardScaler

# Regresion lineal
from sklearn.linear_model import LinearRegression

# Importar/ Exportar modelos
from joblib import dump, load

# Metricas
from sklearn.metrics import mean_squared_error as mse

# q-q plots
import scipy.stats as stats

## 2. Carga de datos

In [2]:
# Se cargan los datos. 
df_factD = pd.read_csv('fact_order.csv', index_col=0)
print(df_factD.shape)
df_factD.head(5)

(1000, 14)

,city_key,customer_key,stock_item_key,order_date_key,picked_date_key,salesperson_key,picker_key,package,quantity,unit_price,tax_rate,total_excluding_tax,tax_amount,total_including_tax
order_key,,,,,,,,,,,,,,
1,91,179,533,2014-02-05,2013-03-17,135,122,S,805,237.77,61,2245.39,305.40,7529.12
2,83,2,631,2015-11-17,2013-07-19,2,133,S,76,721.71,59,6585.70,135.12,8442.06
3,47,390,174,2015-04-29,2015-11-03,128,75,S,585,2866.71,9,8113.37,792.11,9934.49
4,8,218,157,2015-04-04,2014-12-03,84,191,S,878,4671.07,39,9109.56,668.65,6166.09
5,94,167,235,2015-01-26,2015-01-11,91,197,S,583,1950.68,24,9277.41,66.55,3885.52

In [3]:
# Se cargan los datos. 
df_cityD = pd.read_csv('dimension_city.csv', index_col=0)
print(df_cityD.shape)
df_cityD.head(5)

(98, 9)

,City_Key,City,State_Province,Country,Continent,Sales_Territory,Region,Subregion,Latest_Recorded_Population
row ID,,,,,,,,,
Row0,0,Unknown,NaN,NaN,NaN,NaN,NaN,NaN,0
Row1,1,Carrollton,New York,United States,North America,Mideast,Americas,Northern America,0
Row2,2,Carrollton,Virginia,United States,North America,Southeast,Americas,Northern America,4574
Row3,3,Carrollton,Illinois,United States,North America,Great Lakes,Americas,Northern America,2484
Row4,4,Carrollton,Missouri,United States,North America,Plains,Americas,Northern America,3784

In [4]:
# Se cargan los datos. 
df_customerD = pd.read_csv('dimension_customer.csv', index_col=0, encoding='latin-1')
print(df_cityD.shape)
df_customerD.head(5)

(98, 9)

,Customer,Bill_To_Customer,Category,Buying_Group,Primary_Contact,Postal_Code
Customer_Key,,,,,,
0,Unknown,NaN,NaN,NaN,NaN,NaN
1,Tailspin Toys (Head Office),Tailspin Toys (Head Office),Novelty Shop,Tailspin Toys,Waldemar Fisar,90410.0
2,Tailspin Toys (Sylvanite- MT),Tailspin Toys (Head Office),Novelty Shop,Tailspin Toys,Lorena Cindric,90216.0
3,Tailspin Toys (Peeples Valley- AZ),Tailspin Toys (Head Office),Novelty Shop,Tailspin Toys,Bhaargav Rambhatla,90205.0
4,Tailspin Toys (Medicine Lodge- KS),Tailspin Toys (Head Office),Novelty Shop,Tailspin Toys,Daniel Roman,90152.0

In [5]:
# Se cargan los datos. 
df_dateD = pd.read_csv('dimension_date.csv', index_col=0)
print(df_dateD.shape)
df_dateD.head(5)

(1461, 8)

,Day_Number,Day_val,Month_val,Short_Month,Calendar_Month_Number,Calendar_Year,Fiscal_Month_Number,Fiscal_Year
Date_key,,,,,,,,
2013-01-01,1,1,January,Jan,1,2013,3,2013
2013-01-02,2,2,January,Jan,1,2013,3,2013
2013-01-03,3,3,January,Jan,1,2013,3,2013
2013-01-04,4,4,January,Jan,1,2013,3,2013
2013-01-05,5,5,January,Jan,1,2013,3,2013

In [6]:
# Se cargan los datos. 
df_employeeD = pd.read_csv('dimension_employee.csv', index_col=0)
print(df_employeeD.shape)
df_employeeD.head(5)

(213, 3)

                   Employee Preferred_Name  Is_Salesperson
Employee_Key
0                   Unknown            NaN           False
1                 Lily Code           Lily            True
2             Isabella Rupp       Isabella           False
3              Ethan Onslow          Ethan           False
4                 Amy Trefl            Amy            True

In [7]:
# Se cargan los datos. 
df_stockD = pd.read_csv('dimension_stock_item.csv', index_col=0, encoding='latin-1')
print(df_stockD.shape)
df_stockD.head(5)

(672, 13)

,Stock_Item,Color,Selling_Package,Buying_Package,Brand,Size_val,Lead_Time_Days,Quantity_Per_Outer,Is_Chiller_Stock,Tax_Rate,Unit_Price,Recommended_Retail_Price,Typical_Weight_Per_Unit
Stock_Item_Key,,,,,,,,,,,,,
0,Unknown,NaN,NaN,NaN,NaN,NaN,0,0,False,",000",",00",",00",",000"
1,Void fill 400 L bag (White) 400L,NaN,Each,Each,NaN,400L,14,10,False,"14,000","50,00","74,75","1,000"
2,Void fill 300 L bag (White) 300L,NaN,Each,Each,NaN,300L,14,10,False,"14,000","37,50","56,06",",750"
3,Void fill 200 L bag (White) 200L,NaN,Each,Each,NaN,200L,14,10,False,"14,000","25,00","37,38",",500"
4,Void fill 100 L bag (White) 100L,NaN,Each,Each,NaN,100L,14,10,False,"14,000","12,50","18,69",",250"

## 3. Información de datos

In [8]:
df_factD.info()
df_factD.shape

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 1 to 1000
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   city_key             1000 non-null   int64
 1   customer_key         1000 non-null   int64
 2   stock_item_key       1000 non-null   int64
 3   order_date_key       1000 non-null   object
 4   picked_date_key      1000 non-null   object
 5   salesperson_key      1000 non-null   int64
 6   picker_key           1000 non-null   int64
 7   package              1000 non-null   object
 8   quantity             1000 non-null   int64
 9   unit_price           1000 non-null   float64
 10  tax_rate             1000 non-null   int64
 11  total_excluding_tax  1000 non-null   float64
 12  tax_amount           1000 non-null   float64
 13  total_including_tax  1000 non-null   float64
dtypes: float64(4), int64(7), object(3)
memory usage: 117.2+ KB

(1000, 14)

In [9]:
df_cityD.info()
df_cityD.shape

<class 'pandas.core.frame.DataFrame'>
Index: 98 entries, Row0 to Row97
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   City_Key                    98 non-null     int64
 1   City                        98 non-null     object
 2   State_Province              97 non-null     object
 3   Country                     97 non-null     object
 4   Continent                   97 non-null     object
 5   Sales_Territory             97 non-null     object
 6   Region                      97 non-null     object
 7   Subregion                   97 non-null     object
 8   Latest_Recorded_Population  98 non-null     int64
dtypes: int64(2), object(7)
memory usage: 7.7+ KB

(98, 9)

In [10]:
df_customerD.info()
df_customerD.shape

<class 'pandas.core.frame.DataFrame'>
Int64Index: 403 entries, 0 to 402
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Customer          403 non-null    object
 1   Bill_To_Customer  402 non-null    object
 2   Category          402 non-null    object
 3   Buying_Group      402 non-null    object
 4   Primary_Contact   402 non-null    object
 5   Postal_Code       402 non-null    float64
dtypes: float64(1), object(5)
memory usage: 22.0+ KB

(403, 6)

In [11]:
df_dateD.info()
df_dateD.shape

<class 'pandas.core.frame.DataFrame'>
Index: 1461 entries, 2013-01-01 to 2016-12-31
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Day_Number             1461 non-null   int64
 1   Day_val                1461 non-null   int64
 2   Month_val              1461 non-null   object
 3   Short_Month            1461 non-null   object
 4   Calendar_Month_Number  1461 non-null   int64
 5   Calendar_Year          1461 non-null   int64
 6   Fiscal_Month_Number    1461 non-null   int64
 7   Fiscal_Year            1461 non-null   int64
dtypes: int64(6), object(2)
memory usage: 102.7+ KB

(1461, 8)

In [12]:
df_employeeD.info()
df_employeeD.shape

<class 'pandas.core.frame.DataFrame'>
Int64Index: 213 entries, 0 to 212
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Employee        213 non-null    object
 1   Preferred_Name  212 non-null    object
 2   Is_Salesperson  213 non-null    bool
dtypes: bool(1), object(2)
memory usage: 5.2+ KB

(213, 3)

In [13]:
df_stockD.info()
df_stockD.shape

<class 'pandas.core.frame.DataFrame'>
Int64Index: 672 entries, 0 to 671
Data columns (total 13 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Stock_Item                672 non-null    object
 1   Color                     360 non-null    object
 2   Selling_Package           671 non-null    object
 3   Buying_Package            671 non-null    object
 4   Brand                     67 non-null     object
 5   Size_val                  468 non-null    object
 6   Lead_Time_Days            672 non-null    int64
 7   Quantity_Per_Outer        672 non-null    int64
 8   Is_Chiller_Stock          672 non-null    bool
 9   Tax_Rate                  672 non-null    object
 10  Unit_Price                672 non-null    object
 11  Recommended_Retail_Price  672 non-null    object
 12  Typical_Weight_Per_Unit   672 non-null    object
dtypes: bool(1), int64(2), object(10)
memory usage: 68.9+ KB

(672, 13)

In [14]:
#Como se puede ver, date y fact order no tiene nulos, los demas tienen un nulo que podria ser despreciado y borrado, excepto stock que tiene la columna brand con muchisimos nulos
df_city=df_cityD.dropna()
df_customer=df_customerD.dropna()
df_employee=df_employeeD.dropna()
#Para stock primero revisamos a mayor profundidad los datos, en especial brand

In [15]:
df_stockD.Brand

Stock_Item_Key
0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
      ...
667    NaN
668    NaN
669    NaN
670    NaN
671    NaN
Name: Brand, Length: 672, dtype: object

In [16]:
#Revisamos los datos no nulos en una coppia
df_stock=df_stockD.dropna()
df_stock.Brand

Stock_Item_Key
145    Northwind
146    Northwind
147    Northwind
149    Northwind
151    Northwind
152    Northwind
153    Northwind
154    Northwind
155    Northwind
156    Northwind
158    Northwind
160    Northwind
161    Northwind
162    Northwind
228    Northwind
229    Northwind
230    Northwind
232    Northwind
234    Northwind
235    Northwind
236    Northwind
391    Northwind
393    Northwind
395    Northwind
396    Northwind
397    Northwind
453    Northwind
454    Northwind
455    Northwind
456    Northwind
457    Northwind
459    Northwind
461    Northwind
462    Northwind
463    Northwind
464    Northwind
465    Northwind
466    Northwind
467    Northwind
468    Northwind
469    Northwind
471    Northwind
473    Northwind
474    Northwind
475    Northwind
476    Northwind
488    Northwind
489    Northwind
490    Northwind
492    Northwind
494    Northwind
495    Northwind
496    Northwind
Name: Brand, dtype: object

In [17]:
#Llenaremos los demas datos de Brand con "unknown" para que pueda ser usada

#Se arreglan los datos errones de Clase
def quitarErroneos(row):
    if row != "Northwind" :
      return "unknown"
    return row
    
df_stockD["Brand"] = df_stockD["Brand"].apply(quitarErroneos)

#Ahora todos los datos gozan de completitud, dado el caso no tiene sentido revisar datos outliers

In [18]:
pd.value_counts(df_dateD['Day_val'])
#Como se ve todos los datos son de dias con sentido

1     48
2     48
28    48
27    48
26    48
25    48
24    48
23    48
22    48
21    48
20    48
19    48
18    48
17    48
16    48
15    48
14    48
13    48
12    48
11    48
10    48
9     48
8     48
7     48
6     48
5     48
4     48
3     48
29    45
30    44
31    28
Name: Day_val, dtype: int64

In [19]:
pd.value_counts(df_dateD['Calendar_Month_Number'])
#Como se ve todos los datos son de meses con sentido

1     124
3     124
5     124
7     124
8     124
10    124
12    124
4     120
6     120
9     120
11    120
2     113
Name: Calendar_Month_Number, dtype: int64

In [20]:
pd.value_counts(df_dateD['Calendar_Year'])
#Como se ve todos los datos son de años con sentido

2016    366
2013    365
2014    365
2015    365
Name: Calendar_Year, dtype: int64

In [21]:
pd.value_counts(df_dateD['Fiscal_Year'])
#Como se ve todos los datos son de años con sentido, se finaliza la revisión ya que los demas datos numericos dependen del negocio

2016    366
2014    365
2015    365
2013    304
2017     61
Name: Fiscal_Year, dtype: int64

In [22]:
pd.value_counts(df_stock['Lead_Time_Days'])

14    53
Name: Lead_Time_Days, dtype: int64

In [23]:
pd.value_counts(df_stock['Quantity_Per_Outer'])

1    53
Name: Quantity_Per_Outer, dtype: int64

In [24]:
pd.value_counts(df_stock['Tax_Rate'])

14,000    53
Name: Tax_Rate, dtype: int64

In [25]:
pd.value_counts(df_stock['Unit_Price'])

25,00     16
230,00    12
30,00     10
285,00     8
45,00      4
345,00     3
Name: Unit_Price, dtype: int64

In [26]:
pd.value_counts(df_stock['Recommended_Retail_Price'])

37,38     16
343,85    12
44,85     10
426,08     8
67,28      4
515,78     3
Name: Recommended_Retail_Price, dtype: int64

In [27]:
pd.value_counts(df_stock['Typical_Weight_Per_Unit'])
#Ningun dato se ve fuera de los datos logicos del negocio asi que no se hace nada mas. Ahora se revisa fact order

1,500     16
15,000    12
1,700     10
18,000     8
1,800      4
21,000     3
Name: Typical_Weight_Per_Unit, dtype: int64

In [30]:
pd.value_counts(df_factD['order_date_key'])
#El formato de fecha es constante y no tiene diferentes representaciones

2016-05-28    5
2013-07-27    5
2015-06-06    4
2014-02-21    4
2015-12-19    4
             ..
2016-11-14    1
2014-03-31    1
2014-02-19    1
2015-05-27    1
2015-07-11    1
Name: order_date_key, Length: 724, dtype: int64

In [31]:
pd.value_counts(df_factD['picked_date_key'])
#El formato de fecha es constante y no tiene diferentes representaciones

2016-02-13    4
2015-01-05    4
2013-08-16    4
2013-03-17    3
2015-02-17    3
             ..
2014-07-06    1
2015-04-03    1
2013-08-28    1
2016-04-22    1
2016-11-04    1
Name: picked_date_key, Length: 720, dtype: int64

In [32]:
pd.value_counts(df_factD['package'])
#No hay valores outliers, los demas datos son numericos con muchas posibilidades asi que aunque se revisaron, no se incluye
#la revision dado que son demasiadas. Pero se concluye que con esto, todos los datos ya estan limpios.

S     512
M     235
L     129
X      65
XL     59
Name: package, dtype: int64